In [2]:
import pandas as pd
from pandas import json_normalize
import numpy as np

from urllib.request import urlopen
import json

import os.path

# Lotto 다음 회차 예측 프로그램
- 인공지능 분석 통한 로또 당첨 번호 예측
- 매주 월요일 진행하도록 크롬 작업 진행
    * 첫 시작 / 추가 진행 두 파트로 프로그램 진행되도록 코딩

### 1. API 통해 회차별 당첨번호
- returnValue : 요청결과
- totsellamnt : 총상금액
- drwNoDate : 날짜
- firstWinamnt : 1등 상금액
- firstPrzwnerCo : 1등 당첨자 수
- drwNo : 로또회차
- drwNo1 - 6 : 당첨번호 1 - 6
- bnusNo : 보너스 번호

In [2]:
#url = https://www.dhlottery.co.kr/common.do?method=getLottoNumber&drwNo={회차}

response_test = urlopen("https://www.dhlottery.co.kr/common.do?method=getLottoNumber&drwNo=1")
response_test

In [3]:
decode_test = response_test.read().decode("utf-8")
data_json_test = json.loads(decode_test)
data_json_test

{'totSellamnt': 3681782000,
 'returnValue': 'success',
 'drwNoDate': '2002-12-07',
 'firstWinamnt': 0,
 'drwtNo6': 40,
 'drwtNo4': 33,
 'firstPrzwnerCo': 0,
 'drwtNo5': 37,
 'bnusNo': 16,
 'firstAccumamnt': 863604600,
 'drwNo': 1,
 'drwtNo2': 23,
 'drwtNo3': 29,
 'drwtNo1': 10}

In [4]:
data_json_test.values()

dict_values([3681782000, 'success', '2002-12-07', 0, 40, 33, 0, 37, 16, 863604600, 1, 23, 29, 10])

In [5]:
data_json_test.keys()

dict_keys(['totSellamnt', 'returnValue', 'drwNoDate', 'firstWinamnt', 'drwtNo6', 'drwtNo4', 'firstPrzwnerCo', 'drwtNo5', 'bnusNo', 'firstAccumamnt', 'drwNo', 'drwtNo2', 'drwtNo3', 'drwtNo1'])

In [16]:
data_json_test['returnValue']

'success'

In [6]:
df_test = json_normalize(data_json_test)
df_test

,totSellamnt,returnValue,drwNoDate,firstWinamnt,drwtNo6,drwtNo4,firstPrzwnerCo,drwtNo5,bnusNo,firstAccumamnt,drwNo,drwtNo2,drwtNo3,drwtNo1
0,3681782000,success,2002-12-07,0,40,33,0,37,16,863604600,1,23,29,10

In [7]:
# 2회차
response2 = urlopen("https://www.dhlottery.co.kr/common.do?method=getLottoNumber&drwNo=2")
decode2 = response2.read().decode("utf-8")
data_json2 = json.loads(decode2)
df_test_2 = json_normalize(data_json2)
df_test_2

,totSellamnt,returnValue,drwNoDate,firstWinamnt,drwtNo6,drwtNo4,firstPrzwnerCo,drwtNo5,bnusNo,firstAccumamnt,drwNo,drwtNo2,drwtNo3,drwtNo1
0,4904274000,success,2002-12-14,2002006800,42,25,1,32,2,0,2,13,21,9

In [8]:
dataframe = df_test.append(df_test_2)
dataframe

,totSellamnt,returnValue,drwNoDate,firstWinamnt,drwtNo6,drwtNo4,firstPrzwnerCo,drwtNo5,bnusNo,firstAccumamnt,drwNo,drwtNo2,drwtNo3,drwtNo1
0,3681782000,success,2002-12-07,0,40,33,0,37,16,863604600,1,23,29,10
0,4904274000,success,2002-12-14,2002006800,42,25,1,32,2,0,2,13,21,9

In [9]:
dataframe.drwNo.iloc[-1]

2

In [47]:
datas

,totSellamnt,returnValue,drwNoDate,firstWinamnt,drwtNo6,drwtNo4,firstPrzwnerCo,drwtNo5,bnusNo,firstAccumamnt,drwNo,drwtNo2,drwtNo3,drwtNo1
0,3.681782e+09,success,2002-12-07,0.000000e+00,40.0,33.0,0.0,37.0,16.0,8.636046e+08,1.0,23.0,29.0,10.0
0,4.904274e+09,success,2002-12-14,2.002007e+09,42.0,25.0,1.0,32.0,2.0,0.000000e+00,2.0,13.0,21.0,9.0
0,4.729342e+09,success,2002-12-21,2.000000e+09,31.0,21.0,1.0,27.0,30.0,0.000000e+00,3.0,16.0,19.0,11.0
0,5.271464e+09,success,2002-12-28,0.000000e+00,42.0,31.0,0.0,40.0,2.0,1.267147e+09,4.0,27.0,30.0,14.0
0,6.277102e+09,success,2003-01-04,0.000000e+00,42.0,40.0,0.0,41.0,3.0,3.041095e+09,5.0,24.0,29.0,16.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
0,1.080726e+11,success,2023-01-14,1.535083e+09,43.0,35.0,17.0,38.0,17.0,2.609642e+10,1050.0,12.0,31.0,6.0
0,1.192439e+11,success,2023-01-21,1.669558e+09,35.0,32.0,18.0,33.0,44.0,3.005205e+10,1051.0,26.0,30.0,21.0
0,1.075655e+11,success,2023-01-28,2.341683e+09,38.0,27.0,11.0,35.0,1.0,2.575851e+10,1052.0,17.0,26.0,5.0
0,1.137217e+11,success,2023-02-04,4.090367e+09,45.0,30.0,7.0,34.0,15.0,2.863257e+10,1053.0,26.0,29.0,22.0
0,NaN,fail,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [51]:
# 1회차부터 수집해 returnValue가 False일 때까지 수집해 DF으로 만들고 CSV로 저장
def get_data():
    csv_path = "data/data.csv"
    cnt = 1
    returnValue = "success"
    while returnValue == "success":
        print(cnt)
        print(returnValue)
        if cnt == 1:
            response = urlopen(f"https://www.dhlottery.co.kr/common.do?method=getLottoNumber&drwNo={cnt}")
            decode = response.read().decode("utf-8")
            data_json = json.loads(decode)
            datas = json_normalize(data_json)
        elif cnt != 1:
            response = urlopen(f"https://www.dhlottery.co.kr/common.do?method=getLottoNumber&drwNo={cnt}")
            decode = response.read().decode("utf-8")
            data_json = json.loads(decode)
            data = json_normalize(data_json)
            datas = datas.append(data)
        cnt += 1
        returnValue = data_json['returnValue']
    
    print("get_data ::: END get data from API")
    datas.to_csv(csv_path)

# 매주 월요일, 전 주 결과를 추가해 분석하고 당첨번호를 예측해야함
def add_data():
    # 지정된 경로에 csv파일이 있다면?
    csv_path = "data/data.csv"
    if os.path.isfile(csv_path) == True:
            df = pd.read_csv(csv_path)
            last_drwNo = df.drwNo.iloc[-1] 
            while data_json.returnValue == 'success':
                response = urlopen(f"https://www.dhlottery.co.kr/common.do?method=getLottoNumber&drwNo={last_drwNo}")
                decode = response.read().decode("utf-8")
                data_json = json.loads(decode)
                data = json_normalize(data_json)
                df.append(data)
                last_drwNo += 1
    df.to_csv(csv_path)
    return df

# reset & make dataset
- Variable Value?
- Timeseries?
- Patterns

In [3]:
df = pd.read_csv("data/data.csv", encoding='utf-8', index_col=0)
df

,totSellamnt,returnValue,drwNoDate,firstWinamnt,drwtNo6,drwtNo4,firstPrzwnerCo,drwtNo5,bnusNo,firstAccumamnt,drwNo,drwtNo2,drwtNo3,drwtNo1
0,3.681782e+09,success,2002-12-07,0.000000e+00,40.0,33.0,0.0,37.0,16.0,8.636046e+08,1.0,23.0,29.0,10.0
0,4.904274e+09,success,2002-12-14,2.002007e+09,42.0,25.0,1.0,32.0,2.0,0.000000e+00,2.0,13.0,21.0,9.0
0,4.729342e+09,success,2002-12-21,2.000000e+09,31.0,21.0,1.0,27.0,30.0,0.000000e+00,3.0,16.0,19.0,11.0
0,5.271464e+09,success,2002-12-28,0.000000e+00,42.0,31.0,0.0,40.0,2.0,1.267147e+09,4.0,27.0,30.0,14.0
0,6.277102e+09,success,2003-01-04,0.000000e+00,42.0,40.0,0.0,41.0,3.0,3.041095e+09,5.0,24.0,29.0,16.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
0,1.080726e+11,success,2023-01-14,1.535083e+09,43.0,35.0,17.0,38.0,17.0,2.609642e+10,1050.0,12.0,31.0,6.0
0,1.192439e+11,success,2023-01-21,1.669558e+09,35.0,32.0,18.0,33.0,44.0,3.005205e+10,1051.0,26.0,30.0,21.0
0,1.075655e+11,success,2023-01-28,2.341683e+09,38.0,27.0,11.0,35.0,1.0,2.575851e+10,1052.0,17.0,26.0,5.0
0,1.137217e+11,success,2023-02-04,4.090367e+09,45.0,30.0,7.0,34.0,15.0,2.863257e+10,1053.0,26.0,29.0,22.0
0,NaN,fail,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [17]:
df.columns

Index(['totSellamnt', 'returnValue', 'drwNoDate', 'firstWinamnt', 'drwtNo6',
       'drwtNo4', 'firstPrzwnerCo', 'drwtNo5', 'bnusNo', 'firstAccumamnt',
       'drwNo', 'drwtNo2', 'drwtNo3', 'drwtNo1'],
      dtype='object')

In [18]:
for c in df.columns:
    print(c)

totSellamnt
returnValue
drwNoDate
firstWinamnt
drwtNo6
drwtNo4
firstPrzwnerCo
drwtNo5
bnusNo
firstAccumamnt
drwNo
drwtNo2
drwtNo3
drwtNo1

In [19]:
df['totSellamnt'].dtype == 'float64'

True

In [20]:
df.dtypes

totSellamnt       float64
returnValue        object
drwNoDate          object
firstWinamnt      float64
drwtNo6           float64
drwtNo4           float64
firstPrzwnerCo    float64
drwtNo5           float64
bnusNo            float64
firstAccumamnt    float64
drwNo             float64
drwtNo2           float64
drwtNo3           float64
drwtNo1           float64
dtype: object

In [21]:
df.dtypes[0]

dtype('float64')

In [27]:
df.dtypes

totSellamnt        int64
returnValue       object
drwNoDate         object
firstWinamnt       int64
drwtNo6            int64
drwtNo4            int64
firstPrzwnerCo     int64
drwtNo5            int64
bnusNo             int64
firstAccumamnt     int64
drwNo              int64
drwtNo2            int64
drwtNo3            int64
drwtNo1            int64
dtype: object

In [28]:
df

,totSellamnt,returnValue,drwNoDate,firstWinamnt,drwtNo6,drwtNo4,firstPrzwnerCo,drwtNo5,bnusNo,firstAccumamnt,drwNo,drwtNo2,drwtNo3,drwtNo1
0,3681782000,success,2002-12-07,0,40,33,0,37,16,863604600,1,23,29,10
1,4904274000,success,2002-12-14,2002006800,42,25,1,32,2,0,2,13,21,9
2,4729342000,success,2002-12-21,2000000000,31,21,1,27,30,0,3,16,19,11
3,5271464000,success,2002-12-28,0,42,31,0,40,2,1267147200,4,27,30,14
4,6277102000,success,2003-01-04,0,42,40,0,41,3,3041094900,5,24,29,16
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1048,108444724000,success,2023-01-07,1727810100,37,20,15,21,17,25917151500,1049,5,13,3
1049,108072602000,success,2023-01-14,1535083280,43,35,17,38,17,26096415760,1050,12,31,6
1050,119243907000,success,2023-01-21,1669558480,35,32,18,33,44,30052052640,1051,26,30,21
1051,107565461000,success,2023-01-28,2341682762,38,27,11,35,1,25758510382,1052,17,26,5
1052,113721665000,success,2023-02-04,4090367411,45,30,7,34,15,28632571877,1053,26,29,22

In [29]:
df['drwNoDate'] = pd.to_datetime(df['drwNoDate'])

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1053 entries, 0 to 1052
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   totSellamnt     1053 non-null   int64
 1   returnValue     1053 non-null   object
 2   drwNoDate       1053 non-null   datetime64[ns]
 3   firstWinamnt    1053 non-null   int64
 4   drwtNo6         1053 non-null   int64
 5   drwtNo4         1053 non-null   int64
 6   firstPrzwnerCo  1053 non-null   int64
 7   drwtNo5         1053 non-null   int64
 8   bnusNo          1053 non-null   int64
 9   firstAccumamnt  1053 non-null   int64
 10  drwNo           1053 non-null   int64
 11  drwtNo2         1053 non-null   int64
 12  drwtNo3         1053 non-null   int64
 13  drwtNo1         1053 non-null   int64
dtypes: datetime64[ns](1), int64(12), object(1)
memory usage: 115.3+ KB

In [35]:
# 필요한 데이터만 / slicing
# 날짜 / 로또당첨번호 1-6, 보너스번호
df = df[['drwNoDate', 'drwtNo1', 'drwtNo2', 'drwtNo3', 'drwtNo4', 'drwtNo5', 'drwtNo6', 'bnusNo']]

In [36]:
df

      drwNoDate  drwtNo1  drwtNo2  drwtNo3  drwtNo4  drwtNo5  drwtNo6  bnusNo
0    2002-12-07       10       23       29       33       37       40      16
1    2002-12-14        9       13       21       25       32       42       2
2    2002-12-21       11       16       19       21       27       31      30
3    2002-12-28       14       27       30       31       40       42       2
4    2003-01-04       16       24       29       40       41       42       3
...         ...      ...      ...      ...      ...      ...      ...     ...
1048 2023-01-07        3        5       13       20       21       37      17
1049 2023-01-14        6       12       31       35       38       43      17
1050 2023-01-21       21       26       30       32       33       35      44
1051 2023-01-28        5       17       26       27       35       38       1
1052 2023-02-04       22       26       29       30       34       45      15

[1053 rows x 8 columns]

In [5]:
def trans_dataframe():

    # 데이터로드
    df = pd.read_csv("data/data.csv", encoding='utf-8', index_col=0)

    # 마지막 줄 제거
    df = df[0:-1]

    # 불필요한 칼럼 제거
    df = df[['drwNoDate', 'drwtNo1', 'drwtNo2', 'drwtNo3', 'drwtNo4', 'drwtNo5', 'drwtNo6', 'bnusNo']]

    # 인덱스 재설정
    df.reset_index(drop=True, inplace=True)

    # float -> int로 변경
    for c in df.columns:
        try:
            if df[c].dtype == 'float64':
                df = df.astype({c:'int'})
        except:
            pass

    # 시계열
    df['drwNoDate'] = pd.to_datetime(df['drwNoDate'])

    return df

In [6]:
df = trans_dataframe()
df

      drwNoDate  drwtNo1  drwtNo2  drwtNo3  drwtNo4  drwtNo5  drwtNo6  bnusNo
0    2002-12-07       10       23       29       33       37       40      16
1    2002-12-14        9       13       21       25       32       42       2
2    2002-12-21       11       16       19       21       27       31      30
3    2002-12-28       14       27       30       31       40       42       2
4    2003-01-04       16       24       29       40       41       42       3
...         ...      ...      ...      ...      ...      ...      ...     ...
1048 2023-01-07        3        5       13       20       21       37      17
1049 2023-01-14        6       12       31       35       38       43      17
1050 2023-01-21       21       26       30       32       33       35      44
1051 2023-01-28        5       17       26       27       35       38       1
1052 2023-02-04       22       26       29       30       34       45      15

[1053 rows x 8 columns]

# Varibale Factor
- ?
- ?
- ?

# EDA
- 최빈수 6개 / 최빈수 보너스 번호 1개
- 1년 단위 로또 당첨번호 분석
- 계절 단위 로또 당첨번호 분석
- 월 단위 로또 당첨번호 분석

### 1. 가장 많이 나오는 당첨번호 1-6, 보너스

In [57]:
df

      drwNoDate  drwtNo1  drwtNo2  drwtNo3  drwtNo4  drwtNo5  drwtNo6  bnusNo
0    2002-12-07       10       23       29       33       37       40      16
1    2002-12-14        9       13       21       25       32       42       2
2    2002-12-21       11       16       19       21       27       31      30
3    2002-12-28       14       27       30       31       40       42       2
4    2003-01-04       16       24       29       40       41       42       3
...         ...      ...      ...      ...      ...      ...      ...     ...
1048 2023-01-07        3        5       13       20       21       37      17
1049 2023-01-14        6       12       31       35       38       43      17
1050 2023-01-21       21       26       30       32       33       35      44
1051 2023-01-28        5       17       26       27       35       38       1
1052 2023-02-04       22       26       29       30       34       45      15

[1053 rows x 8 columns]

In [58]:
one_six = df.iloc[:, 1:-1]
one_six

      drwtNo1  drwtNo2  drwtNo3  drwtNo4  drwtNo5  drwtNo6
0          10       23       29       33       37       40
1           9       13       21       25       32       42
2          11       16       19       21       27       31
3          14       27       30       31       40       42
4          16       24       29       40       41       42
...       ...      ...      ...      ...      ...      ...
1048        3        5       13       20       21       37
1049        6       12       31       35       38       43
1050       21       26       30       32       33       35
1051        5       17       26       27       35       38
1052       22       26       29       30       34       45

[1053 rows x 6 columns]

In [67]:
bonus = df.iloc[:, -1:]
bonus

      bnusNo
0         16
1          2
2         30
3          2
4          3
...      ...
1048      17
1049      17
1050      44
1051       1
1052      15

[1053 rows x 1 columns]

In [66]:
one_six.describe()

,drwtNo1,drwtNo2,drwtNo3,drwtNo4,drwtNo5,drwtNo6
count,1053.000000,1053.000000,1053.000000,1053.000000,1053.000000,1053.000000
mean,6.685660,13.071225,19.961064,26.252612,32.841406,39.493827
std,5.348053,6.878747,7.471200,7.595702,6.870095,5.309724
min,1.000000,2.000000,3.000000,5.000000,9.000000,18.000000
25%,2.000000,8.000000,14.000000,21.000000,28.000000,37.000000
50%,5.000000,12.000000,19.000000,26.000000,34.000000,41.000000
75%,10.000000,18.000000,26.000000,32.000000,38.000000,44.000000
max,35.000000,37.000000,40.000000,43.000000,44.000000,45.000000

In [68]:
bonus.describe()

            bnusNo
count  1053.000000
mean     22.407407
std      13.198190
min       1.000000
25%      11.000000
50%      23.000000
75%      34.000000
max      45.000000

In [100]:
one_six.mode()

   drwtNo1  drwtNo2  drwtNo3  drwtNo4  drwtNo5  drwtNo6
0      1.0     10.0       13     31.0     34.0     45.0
1      NaN      NaN       20      NaN      NaN      NaN

In [111]:
# 최빈수 뽑기
for m in one_six:
    print(m)
    print(one_six[m].mode().values)

drwtNo1
[1]
drwtNo2
[10]
drwtNo3
[13 20]
drwtNo4
[31]
drwtNo5
[34]
drwtNo6
[45]

In [163]:
def freq():
    modes = {}
    one_six = df.iloc[:, 1:-1]
    bonus = df.iloc[:, -1]
    for i, m in enumerate(one_six):
        mode = one_six[m].mode().values[0]
        modes[m] = mode

    mode = bonus.mode().values[0]
    modes[bonus.name] = mode
    
    print(modes)

In [164]:
freq()

{'drwtNo1': 1, 'drwtNo2': 10, 'drwtNo3': 13, 'drwtNo4': 31, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 43}

### 2. 계절별 자주 나오는 당첨번호

In [8]:
df = trans_dataframe()
df

      drwNoDate  drwtNo1  drwtNo2  drwtNo3  drwtNo4  drwtNo5  drwtNo6  bnusNo
0    2002-12-07       10       23       29       33       37       40      16
1    2002-12-14        9       13       21       25       32       42       2
2    2002-12-21       11       16       19       21       27       31      30
3    2002-12-28       14       27       30       31       40       42       2
4    2003-01-04       16       24       29       40       41       42       3
...         ...      ...      ...      ...      ...      ...      ...     ...
1048 2023-01-07        3        5       13       20       21       37      17
1049 2023-01-14        6       12       31       35       38       43      17
1050 2023-01-21       21       26       30       32       33       35      44
1051 2023-01-28        5       17       26       27       35       38       1
1052 2023-02-04       22       26       29       30       34       45      15

[1053 rows x 8 columns]

In [9]:
df_season = df[:]
df_season

      drwNoDate  drwtNo1  drwtNo2  drwtNo3  drwtNo4  drwtNo5  drwtNo6  bnusNo
0    2002-12-07       10       23       29       33       37       40      16
1    2002-12-14        9       13       21       25       32       42       2
2    2002-12-21       11       16       19       21       27       31      30
3    2002-12-28       14       27       30       31       40       42       2
4    2003-01-04       16       24       29       40       41       42       3
...         ...      ...      ...      ...      ...      ...      ...     ...
1048 2023-01-07        3        5       13       20       21       37      17
1049 2023-01-14        6       12       31       35       38       43      17
1050 2023-01-21       21       26       30       32       33       35      44
1051 2023-01-28        5       17       26       27       35       38       1
1052 2023-02-04       22       26       29       30       34       45      15

[1053 rows x 8 columns]

In [10]:
df_season['drwNoDate'][0].month

12

In [19]:
def freq_season():
    spring = [3, 4, 5]
    summer = [6, 7, 8]
    fall = [9, 10, 11]
    winter = [12, 1, 2]

    df_spring = pd.DataFrame()
    df_summer = pd.DataFrame()
    df_fall = pd.DataFrame()
    df_winter = pd.DataFrame()

    for i in df_season.index:
        if df_season['drwNoDate'][i].month in winter:
            # df_season.loc[i, 'season'] = "Winter"
            df_winter = pd.concat((df_winter, df_season.iloc[i:i+1]))
        elif df_season['drwNoDate'][i].month in spring:
            # df_season.loc[i, 'season'] = "Spring"
            df_spring = pd.concat((df_spring, df_season.iloc[i:i+1]))
        elif df_season['drwNoDate'][i].month in summer:
            # df_season.loc[i, 'season'] = "Summer"
            df_summer = pd.concat((df_summer, df_season.iloc[i:i+1]))
        elif df_season['drwNoDate'][i].month in fall:
            # df_season.loc[i, 'season'] = "Fall"
            df_fall = pd.concat((df_fall, df_season.iloc[i:i+1]))

    df_list = [df_spring, df_summer, df_fall, df_winter]

    season_list = ["spring", "summer", "fall", "winter"]
    modes_season = {}
    for s, d in zip(season_list, df_list):
        d.reset_index(drop=True, inplace=True)
        one_six = d.iloc[:, 1:-1]
        bonus = d.iloc[:, -1]
        modes = {}
        for n in one_six:
            mode = one_six[n].mode().values[0]
            modes[n] = mode

        mode = bonus.mode().values[0]
        modes[bonus.name] = mode

        modes_season[s] = modes
        print(f"{s} : {modes}")

In [20]:
freq_season()

spring : {'drwtNo1': 2, 'drwtNo2': 11, 'drwtNo3': 18, 'drwtNo4': 24, 'drwtNo5': 34, 'drwtNo6': 43, 'bnusNo': 35}
summer : {'drwtNo1': 1, 'drwtNo2': 7, 'drwtNo3': 20, 'drwtNo4': 24, 'drwtNo5': 39, 'drwtNo6': 45, 'bnusNo': 10}
fall : {'drwtNo1': 1, 'drwtNo2': 10, 'drwtNo3': 21, 'drwtNo4': 23, 'drwtNo5': 37, 'drwtNo6': 45, 'bnusNo': 43}
winter : {'drwtNo1': 1, 'drwtNo2': 10, 'drwtNo3': 19, 'drwtNo4': 33, 'drwtNo5': 39, 'drwtNo6': 45, 'bnusNo': 6}

### 3. 월별 가장 많이 나온 당첨번호 조회

In [52]:
def freq_month():
    df_list = []
    df_concat = pd.DataFrame()
    df_month = df

    for m in range(1, 13, 1):
        for i in df_month.index:
            if df_month['drwNoDate'][i].month == m:
                df_concat = pd.concat((df_concat, df_month.iloc[i:i+1]))

        df_list.append(df_concat)

    modes_month = {}
    for m, d in enumerate(df_list):
        m += 1
        d.reset_index(drop=True, inplace=True)
        one_six = d.iloc[:, 1:-1]
        bonus = d.iloc[:, -1]
        modes = {}
        for md in one_six:
            mode = one_six[md].mode().values[0]
            modes[md] = mode

        mode = bonus.mode().values[0]
        modes[bonus.name] = mode

        modes_month[m] = modes
        print(f"{m} : {modes}")

In [53]:
freq_month()

1 : {'drwtNo1': 2, 'drwtNo2': 18, 'drwtNo3': 19, 'drwtNo4': 33, 'drwtNo5': 33, 'drwtNo6': 42, 'bnusNo': 1}
2 : {'drwtNo1': 1, 'drwtNo2': 8, 'drwtNo3': 19, 'drwtNo4': 33, 'drwtNo5': 39, 'drwtNo6': 45, 'bnusNo': 6}
3 : {'drwtNo1': 1, 'drwtNo2': 11, 'drwtNo3': 15, 'drwtNo4': 33, 'drwtNo5': 38, 'drwtNo6': 45, 'bnusNo': 38}
4 : {'drwtNo1': 2, 'drwtNo2': 11, 'drwtNo3': 15, 'drwtNo4': 33, 'drwtNo5': 33, 'drwtNo6': 45, 'bnusNo': 3}
5 : {'drwtNo1': 2, 'drwtNo2': 8, 'drwtNo3': 15, 'drwtNo4': 24, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 3}
6 : {'drwtNo1': 1, 'drwtNo2': 11, 'drwtNo3': 15, 'drwtNo4': 24, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 6}
7 : {'drwtNo1': 1, 'drwtNo2': 11, 'drwtNo3': 20, 'drwtNo4': 24, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 6}
8 : {'drwtNo1': 1, 'drwtNo2': 7, 'drwtNo3': 20, 'drwtNo4': 24, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 6}
9 : {'drwtNo1': 1, 'drwtNo2': 7, 'drwtNo3': 20, 'drwtNo4': 24, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 1}
10 : {'drwtNo1': 1, 'drwtNo2': 11, 'drwtNo3': 20, 'drwtNo4': 24, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 32}
11 : {'drwtNo1': 1, 'drwtNo2': 8, 'drwtNo3': 18, 'drwtNo4': 26, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 43}
12 : {'drwtNo1': 1, 'drwtNo2': 10, 'drwtNo3': 13, 'drwtNo4': 31, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 43}

In [54]:
def freq_month():
    df_concat = pd.DataFrame()
    df_month = df
    modes_month = {}

    for m in range(1, 13, 1):
        for i in df_month.index:
            if df_month['drwNoDate'][i].month == m:
                df_concat = pd.concat((df_concat, df_month.iloc[i:i+1]))

        df_concat.reset_index(drop=True, inplace=True)
        one_six = df_concat.iloc[:, 1:-1]
        bonus = df_concat.iloc[:, -1]
        modes = {}
        for md in one_six:
            mode = one_six[md].mode().values[0]
            modes[md] = mode

        mode = bonus.mode().values[0]
        modes[bonus.name] = mode

        modes_month[m] = modes
        print(f"{m} : {modes}")

In [55]:
freq_month()

1 : {'drwtNo1': 2, 'drwtNo2': 18, 'drwtNo3': 19, 'drwtNo4': 33, 'drwtNo5': 33, 'drwtNo6': 42, 'bnusNo': 1}
2 : {'drwtNo1': 1, 'drwtNo2': 8, 'drwtNo3': 19, 'drwtNo4': 33, 'drwtNo5': 39, 'drwtNo6': 45, 'bnusNo': 6}
3 : {'drwtNo1': 1, 'drwtNo2': 11, 'drwtNo3': 15, 'drwtNo4': 33, 'drwtNo5': 38, 'drwtNo6': 45, 'bnusNo': 38}
4 : {'drwtNo1': 2, 'drwtNo2': 11, 'drwtNo3': 15, 'drwtNo4': 33, 'drwtNo5': 33, 'drwtNo6': 45, 'bnusNo': 3}
5 : {'drwtNo1': 2, 'drwtNo2': 8, 'drwtNo3': 15, 'drwtNo4': 24, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 3}
6 : {'drwtNo1': 1, 'drwtNo2': 11, 'drwtNo3': 15, 'drwtNo4': 24, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 6}
7 : {'drwtNo1': 1, 'drwtNo2': 11, 'drwtNo3': 20, 'drwtNo4': 24, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 6}
8 : {'drwtNo1': 1, 'drwtNo2': 7, 'drwtNo3': 20, 'drwtNo4': 24, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 6}
9 : {'drwtNo1': 1, 'drwtNo2': 7, 'drwtNo3': 20, 'drwtNo4': 24, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 1}
10 : {'drwtNo1': 1, 'drwtNo2': 11, 'drwtNo3': 20, 'drwtNo4': 24, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 32}
11 : {'drwtNo1': 1, 'drwtNo2': 8, 'drwtNo3': 18, 'drwtNo4': 26, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 43}
12 : {'drwtNo1': 1, 'drwtNo2': 10, 'drwtNo3': 13, 'drwtNo4': 31, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 43}

In [56]:
df['drwNoDate']

0      2002-12-07
1      2002-12-14
2      2002-12-21
3      2002-12-28
4      2003-01-04
          ...
1048   2023-01-07
1049   2023-01-14
1050   2023-01-21
1051   2023-01-28
1052   2023-02-04
Name: drwNoDate, Length: 1053, dtype: datetime64[ns]

### 4. 연도별 가장 많이 나온 당첨번호 조회

In [71]:
def freq_year():
    # make year list
    year_list = np.unique([df['drwNoDate'][i].year for i in df['drwNoDate'].index])
    df_concat = pd.DataFrame()
    df_year = df[:]
    modes_year = {}

    for y in year_list:
        for i in df['drwNoDate'].index:
            if df_year['drwNoDate'][i].year == y:
                df_concat = pd.concat((df_concat, df_year.iloc[i:i+1]))


        df_concat.reset_index(drop=True, inplace=True)
        one_six = df_concat.iloc[:, 1:-1]
        bonus = df_concat.iloc[:, -1]
        modes = {}
        for md in one_six:
            mode = one_six[md].mode().values[0]
            modes[md] = mode

        mode = bonus.mode().values[0]
        modes[bonus.name] = mode

        modes_year[y] = modes
        print("==========================연도별 가장 많이 나온 당첨번호 6개=======================")
        print(f"{y} : {modes}")

In [72]:
freq_year()

2002 : {'drwtNo1': 9, 'drwtNo2': 13, 'drwtNo3': 19, 'drwtNo4': 21, 'drwtNo5': 27, 'drwtNo6': 42, 'bnusNo': 2}
2003 : {'drwtNo1': 2, 'drwtNo2': 4, 'drwtNo3': 21, 'drwtNo4': 25, 'drwtNo5': 33, 'drwtNo6': 42, 'bnusNo': 1}
2004 : {'drwtNo1': 1, 'drwtNo2': 7, 'drwtNo3': 24, 'drwtNo4': 25, 'drwtNo5': 40, 'drwtNo6': 44, 'bnusNo': 1}
2005 : {'drwtNo1': 2, 'drwtNo2': 7, 'drwtNo3': 30, 'drwtNo4': 34, 'drwtNo5': 40, 'drwtNo6': 43, 'bnusNo': 1}
2006 : {'drwtNo1': 1, 'drwtNo2': 10, 'drwtNo3': 18, 'drwtNo4': 25, 'drwtNo5': 40, 'drwtNo6': 45, 'bnusNo': 1}
2007 : {'drwtNo1': 1, 'drwtNo2': 11, 'drwtNo3': 24, 'drwtNo4': 25, 'drwtNo5': 37, 'drwtNo6': 44, 'bnusNo': 1}
2008 : {'drwtNo1': 1, 'drwtNo2': 11, 'drwtNo3': 24, 'drwtNo4': 25, 'drwtNo5': 37, 'drwtNo6': 45, 'bnusNo': 1}
2009 : {'drwtNo1': 1, 'drwtNo2': 8, 'drwtNo3': 19, 'drwtNo4': 25, 'drwtNo5': 37, 'drwtNo6': 45, 'bnusNo': 1}
2010 : {'drwtNo1': 1, 'drwtNo2': 11, 'drwtNo3': 15, 'drwtNo4': 25, 'drwtNo5': 37, 'drwtNo6': 45, 'bnusNo': 1}
2011 : {'drwtNo1': 1, 'drwtNo2': 11, 'drwtNo3': 20, 'drwtNo4': 31, 'drwtNo5': 37, 'drwtNo6': 45, 'bnusNo': 43}
2012 : {'drwtNo1': 1, 'drwtNo2': 8, 'drwtNo3': 20, 'drwtNo4': 27, 'drwtNo5': 37, 'drwtNo6': 45, 'bnusNo': 43}
2013 : {'drwtNo1': 1, 'drwtNo2': 12, 'drwtNo3': 20, 'drwtNo4': 27, 'drwtNo5': 37, 'drwtNo6': 45, 'bnusNo': 43}
2014 : {'drwtNo1': 1, 'drwtNo2': 8, 'drwtNo3': 20, 'drwtNo4': 27, 'drwtNo5': 37, 'drwtNo6': 45, 'bnusNo': 43}
2015 : {'drwtNo1': 1, 'drwtNo2': 8, 'drwtNo3': 20, 'drwtNo4': 27, 'drwtNo5': 38, 'drwtNo6': 45, 'bnusNo': 43}
2016 : {'drwtNo1': 1, 'drwtNo2': 8, 'drwtNo3': 20, 'drwtNo4': 27, 'drwtNo5': 37, 'drwtNo6': 45, 'bnusNo': 43}
2017 : {'drwtNo1': 1, 'drwtNo2': 8, 'drwtNo3': 20, 'drwtNo4': 27, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 43}
2018 : {'drwtNo1': 1, 'drwtNo2': 10, 'drwtNo3': 13, 'drwtNo4': 31, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 43}
2019 : {'drwtNo1': 1, 'drwtNo2': 10, 'drwtNo3': 19, 'drwtNo4': 26, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 43}
2020 : {'drwtNo1': 1, 'drwtNo2': 8, 'drwtNo3': 18, 'drwtNo4': 26, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 43}
2021 : {'drwtNo1': 1, 'drwtNo2': 10, 'drwtNo3': 13, 'drwtNo4': 31, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 43}
2022 : {'drwtNo1': 1, 'drwtNo2': 10, 'drwtNo3': 20, 'drwtNo4': 31, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 43}
2023 : {'drwtNo1': 1, 'drwtNo2': 10, 'drwtNo3': 13, 'drwtNo4': 31, 'drwtNo5': 34, 'drwtNo6': 45, 'bnusNo': 43}

### 5. 번호 입력하면 그 번호를 포함해 최빈수 뽑기

In [64]:
def freq_choice():
    print("freq_choice ::: 1부터 45 중 번호 하나를 입력해주세요!")
    choice = int(input())
    df_concat = pd.DataFrame()
    modes_choice = {}
    df_choice = df[:]

    for i in df_choice.index:
        if choice in df_choice.iloc[i, 1:].values:
            df_concat = pd.concat((df_concat, df_choice.iloc[i:i+1]))
        else:
            pass

    df_concat.reset_index(drop=True, inplace=True)
    one_six = df_concat.iloc[:, 1:-1]
    modes = {}
    for md in one_six:
        mode = one_six[md].mode().values[0]
        modes[md] = mode

    modes_choice["choice"] = modes

    print(f" ")
    print(f"=========================={choice} 포함 가장 많이 나온 당첨번호 6개=======================")
    print(f"choice : {modes}")
    print(f" ")
    print(f"            ==========================DataFrame=======================")
    print(f"            ==========================================================")
    print(f" ")
    print(df_concat[-20:])

In [65]:
freq_choice()

freq_choice ::: 1부터 45 중 번호 하나를 입력해주세요!

==========================5 포함 가장 많이 나온 당첨번호 6개=======================
choice : {'drwtNo1': 5, 'drwtNo2': 5, 'drwtNo3': 14, 'drwtNo4': 29, 'drwtNo5': 34, 'drwtNo6': 45}

            ==========================DataFrame=======================
            ==========================================================

     drwNoDate  drwtNo1  drwtNo2  drwtNo3  drwtNo4  drwtNo5  drwtNo6  bnusNo
141 2020-05-23        5        8       18       21       22       38      10
142 2020-07-04        7       11       12       31       33       38       5
143 2020-07-25        5        7       12       22       28       41       1
144 2020-10-10        1        6       15       36       37       38       5
145 2021-01-30       13       18       30       31       38       41       5
146 2021-06-19        2        5       12       14       24       39      33
147 2021-07-03        9       11       16       21       28       36       5
148 2021-08-07        7        8        9       17       22       24       5
149 2021-09-25        5        7       13       20       21       44      33
150 2022-04-23        5       11       18       20       35       45       3
151 2022-07-02        5        6       11       29       42       45      28
152 2022-07-30        5       12       13       31       32       41      34
153 2022-08-06       14       16       27       35       39       45       5
154 2022-08-13        5        7       12       13       18       35      23
155 2022-08-27        2        5       11       17       24       29       9
156 2022-10-08        2        5       22       32       34       45      39
157 2022-11-19        5       14       15       23       34       43       4
158 2022-11-26        3        5       12       22       26       31      19
159 2023-01-07        3        5       13       20       21       37      17
160 2023-01-28        5       17       26       27       35       38       1

In [75]:
print(
f"""{df['drwtNo1'].value_counts()[0:5]}
{df['drwtNo2'].value_counts()[0:5]}
{df['drwtNo3'].value_counts()[0:5]}
{df['drwtNo4'].value_counts()[0:5]}
{df['drwtNo5'].value_counts()[0:5]}
{df['drwtNo6'].value_counts()[0:5]}"""
)

1    146
2    121
3    103
4     92
5     88
Name: drwtNo1, dtype: int64
10    65
8     64
11    64
12    62
7     62
Name: drwtNo2, dtype: int64
20    59
13    59
18    57
19    55
15    53
Name: drwtNo3, dtype: int64
31    56
26    53
27    52
33    51
24    50
Name: drwtNo4, dtype: int64
34    73
39    68
38    61
37    61
36    55
Name: drwtNo5, dtype: int64
45    148
44    130
43    116
42     90
40     81
Name: drwtNo6, dtype: int64

In [63]:
df.columns[1]

'drwtNo1'

### 6. 5주, 10주, 15주동안 안나온 번호 뽑아내기

In [76]:
df = trans_dataframe()
df

      drwNoDate  drwtNo1  drwtNo2  drwtNo3  drwtNo4  drwtNo5  drwtNo6  bnusNo
0    2002-12-07       10       23       29       33       37       40      16
1    2002-12-14        9       13       21       25       32       42       2
2    2002-12-21       11       16       19       21       27       31      30
3    2002-12-28       14       27       30       31       40       42       2
4    2003-01-04       16       24       29       40       41       42       3
...         ...      ...      ...      ...      ...      ...      ...     ...
1048 2023-01-07        3        5       13       20       21       37      17
1049 2023-01-14        6       12       31       35       38       43      17
1050 2023-01-21       21       26       30       32       33       35      44
1051 2023-01-28        5       17       26       27       35       38       1
1052 2023-02-04       22       26       29       30       34       45      15

[1053 rows x 8 columns]

In [78]:
no_15 = df.iloc[-15:, 1:]
no_15

      drwtNo1  drwtNo2  drwtNo3  drwtNo4  drwtNo5  drwtNo6  bnusNo
1038        2        3        6       19       36       39      26
1039        8       16       26       29       31       36      11
1040        6        7        9       11       17       18      45
1041        5       14       15       23       34       43       4
1042        3        5       12       22       26       31      19
1043       12       17       20       26       28       36       4
1044        6       14       15       19       21       41      37
1045        7       16       25       29       35       36      28
1046        2       20       33       40       42       44      32
1047        6       12       17       21       32       39      30
1048        3        5       13       20       21       37      17
1049        6       12       31       35       38       43      17
1050       21       26       30       32       33       35      44
1051        5       17       26       27       35       38       1
1052       22       26       29       30       34       45      15

In [81]:
no_15.iloc[-1].values

array([22, 26, 29, 30, 34, 45, 15])

In [90]:
len(no_15)

15

In [84]:
no_15.index

RangeIndex(start=1038, stop=1053, step=1)

In [98]:
number = [i for i in range(1, 46, 1)]
no_15_number =  np.unique([no_15.iloc[i].values for i in range(len(no_15))])

for n in number:
    if n in no_15_number: 
        pass
    else:
        print(n)

10
24

In [94]:
for n in number:
    print(n)
    print(type(n))

1
<class 'int'>
2
<class 'int'>
3
<class 'int'>
4
<class 'int'>
5
<class 'int'>
6
<class 'int'>
7
<class 'int'>
8
<class 'int'>
9
<class 'int'>
10
<class 'int'>
11
<class 'int'>
12
<class 'int'>
13
<class 'int'>
14
<class 'int'>
15
<class 'int'>
16
<class 'int'>
17
<class 'int'>
18
<class 'int'>
19
<class 'int'>
20
<class 'int'>
21
<class 'int'>
22
<class 'int'>
23
<class 'int'>
24
<class 'int'>
25
<class 'int'>
26
<class 'int'>
27
<class 'int'>
28
<class 'int'>
29
<class 'int'>
30
<class 'int'>
31
<class 'int'>
32
<class 'int'>
33
<class 'int'>
34
<class 'int'>
35
<class 'int'>
36
<class 'int'>
37
<class 'int'>
38
<class 'int'>
39
<class 'int'>
40
<class 'int'>
41
<class 'int'>
42
<class 'int'>
43
<class 'int'>
44
<class 'int'>
45
<class 'int'>

In [96]:
np.array(no_15_number).reshape(-1)

array([ 2,  3,  6, 19, 36, 39, 26,  8, 16, 26, 29, 31, 36, 11,  6,  7,  9,
       11, 17, 18, 45,  5, 14, 15, 23, 34, 43,  4,  3,  5, 12, 22, 26, 31,
       19, 12, 17, 20, 26, 28, 36,  4,  6, 14, 15, 19, 21, 41, 37,  7, 16,
       25, 29, 35, 36, 28,  2, 20, 33, 40, 42, 44, 32,  6, 12, 17, 21, 32,
       39, 30,  3,  5, 13, 20, 21, 37, 17,  6, 12, 31, 35, 38, 43, 17, 21,
       26, 30, 32, 33, 35, 44,  5, 17, 26, 27, 35, 38,  1, 22, 26, 29, 30,
       34, 45, 15])

In [97]:
np.unique(no_15_number)

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 11, 12, 13, 14, 15, 16, 17, 18,
       19, 20, 21, 22, 23, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36,
       37, 38, 39, 40, 41, 42, 43, 44, 45])

In [99]:
a=5
print(-a)

-5

In [100]:
def no_exist():
    number = [i for i in range(1, 46, 1)]

    for w in range(5, 16, 5):
        df_split = df.iloc[-w:, 1:]
        value_unique =  np.unique([df_split.iloc[i].values for i in range(len(df_split))])

        no_list = []
        for n in number:
            if n in value_unique: 
                pass
            else:
                no_list.append(n)
        
        print(f"{w}주간 나오지 않은 번호 : {no_list}")

In [101]:
no_exist()

5주간 나오지 않은 번호 : [2, 4, 7, 8, 9, 10, 11, 14, 16, 18, 19, 23, 24, 25, 28, 36, 39, 40, 41, 42]
10주간 나오지 않은 번호 : [8, 9, 10, 11, 18, 23, 24]
15주간 나오지 않은 번호 : [10, 24]